package com.wowotou.payservice.bean.kongbao;

import java.io.Serializable;
import java.util.List;

public class KdRetModel implements Serializable {

    /**
     * kdPrice : [{"kdId":107,"kdName":"加运美速递（淘宝-专用）","apiPrice":0.9,"pid":1,"tips":"该快递目前只支持《淘宝》《天猫》《阿里》卖家订单发货，每天22:00点之前下单24点左右出物流，超22:00点以后购买的是第二天24点左右出物流！（请切换旧版发货）"},{"kdId":99,"kdName":"D 速物流（淘宝-专用）","apiPrice":0.7,"pid":11,"tips":"该快递目前只支持《淘宝》《天猫》卖家订单发货，每天22:00点之前下单24点左右出物流，超22:00点以后购买的是第二天24点左右出物流。选择切换旧版本发货！"},{"kdId":124,"kdName":"安迅物流（淘宝-专用）","apiPrice":0.8,"pid":12,"tips":"该快递目前只支持《淘宝》《天猫》卖家订单发货，每天22:00点之前下单24点左右出物流，超22:00点以后购买的是第二天24点左右出物流！（请切换旧版发货）"},{"kdId":122,"kdName":"亚风速递（淘宝-专用）","apiPrice":0.9,"pid":13,"tips":"该快递目前只支持《淘宝》《天猫》卖家订单发货，每天22:00点之前下单24点左右出物流，超22:00点以后购买的是第二天24点左右出物流！（请切换旧版发货）"},{"kdId":89,"kdName":"中通快运（菜鸟-电子）","apiPrice":1,"pid":13,"tips":"-------(切记：选择中通快运发货！)-------本快递是淘宝菜鸟电子面单支持《淘宝》《天猫》《阿里》发货直接购买后发货无需申请网点，每天14点之前下单当天18点左右出物流，22:00点之前下单早上7点左右出物流，超22:00点以后购买的是第二天14点发货！(切记：选择中通快运发货！)（请切换旧版发货）"},{"kdId":33,"kdName":"增益速递（淘宝-专用）","apiPrice":1.1,"pid":15,"tips":"该快递目前只支持《淘宝》《天猫》卖家订单发货，每天22:00点之前下单24点左右出物流，超22:00点以后购买的是第二天24点左右出物流！"},{"kdId":62,"kdName":"安能物流（淘宝-专用）","apiPrice":1.1,"pid":15,"tips":"请在淘宝发货页面选旧版本后选安能物流发货否则不显示物流，每天21:30点之前下单24点左右出物流，超21:30点以后购买的是第二天24点左右出物流！"},{"kdId":129,"kdName":"天天快递（淘宝-专用）","apiPrice":1.15,"pid":16,"tips":"该快递目前只支持《淘宝》《天猫》《阿里》卖家订单发货，每天22:00点之前下单24点左右出物流，超22:00点以后购买的是第二天24点左右出物流！"},{"kdId":128,"kdName":"天天快递（菜鸟-电子）","apiPrice":1.2,"pid":17,"tips":"本快递是淘宝菜鸟电子面单支持《淘宝》《天猫》《阿里》发货直接购买后发货无需申请网点，每天14点之前下单当天18点左右出物流，22:00点之前下单早上7点左右出物流，超22:00点以后购买的是第二天14点发货！"},{"kdId":121,"kdName":"国通快递（菜鸟-电子）","apiPrice":1.2,"pid":17,"tips":"本快递是淘宝菜鸟电子面单支持《淘宝》《天猫》《阿里》发货直接购买后发货无需申请网点，每天14点之前下单当天18点左右出物流，22:00点之前下单早上7点左右出物流，超22:00点以后购买的是第二天14点发货！"},{"kdId":45,"kdName":"国通快递（淘宝-专用）","apiPrice":1.2,"pid":17,"tips":"该快递目前只支持《淘宝》《天猫》《阿里》卖家订单发货，每天22:00点之前下单24点左右出物流，超22:00点以后购买的是第二天24点左右出物流。（选自己联系物流发货）另：本快递不支持新疆地区！"},{"kdId":91,"kdName":"全峰快递（淘宝-专用）","apiPrice":1.2,"pid":17,"tips":"该快递目前只支持《淘宝》《天猫》《阿里》卖家订单发货，每天21:00点之前下单24点左右出物流，超21:00点以后购买的是第二天24点左右出物流！另：本快递不支持西藏地区！"},{"kdId":86,"kdName":"优速快递（淘宝-专用）","apiPrice":1.2,"pid":17,"tips":"该快递目前只支持《淘宝》《天猫》《阿里》卖家订单发货，每天22:00点之前下单24点左右出物流，超22:00点以后购买的是第二天24点左右出物流。（选自己联系物流发货）另：本快递不支持新疆地区！"},{"kdId":74,"kdName":"百世快递（淘宝-专用）","apiPrice":1.4,"pid":18,"tips":"该快递目前只支持《淘宝》《天猫》卖家订单发货，每天22:00点之前下单24点左右出物流，超22:00点以后购买的是第二天24点左右出物流！"},{"kdId":54,"kdName":"申通快递（淘宝-专用）","apiPrice":1.55,"pid":18,"tips":"该快递目前只支持《淘宝》《天猫》《阿里》卖家订单发货，每天22:00点之前下单24点左右出物流，超22:00点以后购买的是第二天24点左右出物流！购买后请及时发货否则不出物流跟踪！"},{"kdId":105,"kdName":"中通快递（淘宝-专用）","apiPrice":1.55,"pid":19,"tips":"该快递目前只支持《淘宝》《天猫》卖家订单发货，每天22:00点之前下单24点左右出物流，超22:00点以后购买的是第二天24点左右出物流！（购买成功后请在当天在淘宝后台发货，否则物流更新不及时。）"},{"kdId":92,"kdName":"全峰快递（京东-专用）","apiPrice":0.6,"pid":2,"tips":"该快递目前只支持《京东》卖家订单发货，每天21:00点之前下单24点左右出物流，超21:00点以后购买的是第二天24点左右出物流！（本单号严禁淘宝发货，一旦在淘宝发货将无法显示物流！）另：本快递不支持西藏地区！"},{"kdId":55,"kdName":"申通快递（京东-专用）","apiPrice":0.75,"pid":21,"tips":"该快递目前只支持《京东》卖家订单发货，每天22:00点之前下单24点左右出物流，超22:00点以后购买的是第二天24点左右出物流！（本单号严禁淘宝发货，一旦在淘宝发货将无法显示物流！）"},{"kdId":95,"kdName":"圆通速递（京东-无界）","apiPrice":1.5,"pid":29,"tips":"注意：本快递是无界面单只能用京东商城发货，每天14点之前下单当天18点左右出物流，22:00点之前下单早上10点左右出物流，超22:00点以后购买的是第二天14点发货！"},{"kdId":108,"kdName":"加运美(拼多多-专用)","apiPrice":0.45,"pid":30,"tips":"该快递目前只支持《拼多多》卖家订单发货，每天14点之前下单当天18点左右出物流，22:00点之前下单早上7点左右出物流，超22:00点以后购买的是第二天14点发货！"},{"kdId":131,"kdName":"速尔快递(拼多多-专用)","apiPrice":0.5,"pid":30,"tips":"该快递目前只支持《拼多多》卖家订单发货，每天14点之前下单当天18点左右出物流，22:00点之前下单早上7点左右出物流，超22:00点以后购买的是第二天14点发货！"},{"kdId":118,"kdName":"商桥物流(拼多多-专用)","apiPrice":0.4,"pid":31,"tips":"该快递目前只支持《拼多多》卖家订单发货，每天14点之前下单当天18点左右出物流，22:00点之前下单早上7点左右出物流，超22:00点以后购买的是第二天14点发货！"},{"kdId":100,"kdName":"D速物流 (拼多多-专用)","apiPrice":0.4,"pid":31,"tips":"该快递目前只支持《拼多多》卖家订单发货，每天14点之前下单当天18点左右出物流，22:00点之前下单早上7点左右出物流，超22:00点以后购买的是第二天14点发货！"},{"kdId":98,"kdName":"安迅物流(拼多多-专用)","apiPrice":0.45,"pid":32,"tips":"该快递目前只支持《拼多多》卖家订单发货，每天14点之前下单当天18点左右出物流，22:00点之前下单早上7点左右出物流，超22:00点以后购买的是第二天14点发货！"},{"kdId":88,"kdName":"远成快运(拼多多-专用)","apiPrice":0.45,"pid":32,"tips":"该快递目前只支持《拼多多》卖家订单发货，每天14点之前下单当天18点左右出物流，22:00点之前下单早上7点左右出物流，超22:00点以后购买的是第二天14点发货！"},{"kdId":94,"kdName":"京广速递(拼多多-专用)","apiPrice":0.5,"pid":33,"tips":"该快递目前只支持《拼多多》卖家订单发货，每天14点之前下单当天18点左右出物流，22:00点之前下单早上7点左右出物流，超22:00点以后购买的是第二天14点发货！"},{"kdId":126,"kdName":"天天快递(拼多多-专用)","apiPrice":0.55,"pid":33,"tips":"该快递目前只支持《拼多多》卖家订单发货，每天14点之前下单当天18点左右出物流，22:00点之前下单早上7点左右出物流，超22:00点以后购买的是第二天14点发货！"},{"kdId":65,"kdName":"百世快递(拼多多-专用)","apiPrice":0.65,"pid":34,"tips":"该快递目前只支持《拼多多》卖家订单发货，每天14点之前下单当天18点左右出物流，22点之前下单24点左右出物流，超22点以后购买的是第二天14点发货！"},{"kdId":69,"kdName":"亚风速递(拼多多-专用)","apiPrice":0.6,"pid":34,"tips":"该快递目前只支持《拼多多》卖家订单发货，每天14点之前下单当天18点左右出物流，22点之前下单24点左右出物流，超22点以后购买的是第二天14点发货！"},{"kdId":85,"kdName":"优速快递(拼多多-专用)","apiPrice":0.6,"pid":34,"tips":"该快递目前只支持《拼多多》卖家订单发货，每天14点之前下单当天18点左右出物流，22:00点之前下单早上7点左右出物流，超22:00点以后购买的是第二天14点发货！"},{"kdId":72,"kdName":"申通快递(拼多多-专用)","apiPrice":0.8,"pid":35,"tips":"该快递目前只支持《拼多多》卖家订单发货，每天14点之前下单当天18点左右出物流，22:00点之前下单24点左右出物流，超22:00点以后购买的是第二天14点发货！（本单号严禁淘宝发货，一旦在淘宝发货将无法显示物流）"},{"kdId":68,"kdName":"龙邦快递(拼多多-专用)","apiPrice":0.85,"pid":36,"tips":"该快递目前只支持《拼多多》卖家订单发货，每天14点之前下单当天18点左右出物流，22:00点之前下单24点左右出物流，超22:00点以后购买的是第二天14点发货！"},{"kdId":93,"kdName":"中通快递(拼多多-专用)","apiPrice":0.9,"pid":37,"tips":"该快递目前只支持《拼多多》卖家订单发货，每天14点之前下单当天18点左右出物流，22:00点之前下单早上10点左右出物流，超22:00点以后购买的是第二天14点发货！"},{"kdId":81,"kdName":"圆通快递(拼多多-专用)","apiPrice":1.1,"pid":38,"tips":"该快递只支持《拼多多》发货，每天14点之前下单当天18点左右出物流，22点之前下单第二天早上10点左右出物流，超22点后买的是第二天14点发货！注意:如没在拼多多发货的单号不会出物流请购买后第一时间在拼多多发货！"},{"kdId":97,"kdName":"宅急送快递(拼多多-专用)","apiPrice":0.6,"pid":39,"tips":"该快递目前只支持《拼多多》卖家订单发货，每天14点之前下单当天18点左右出物流，22:00点之前下单早上7点左右出物流，超22:00点以后购买的是第二天14点发货！"},{"kdId":115,"kdName":"安迅物流(拼多多-电子)","apiPrice":0.45,"pid":41,"tips":"本快递是拼多多电子面单支持全国发货直接购买后发货无需申请网点，每天14点之前下单当天18点左右出物流，22:00点之前下单凌晨出物流，超22:00点以后购买的是第二天14点发货！"},{"kdId":116,"kdName":"京广速递(拼多多-电子)","apiPrice":0.5,"pid":42,"tips":"本快递是拼多多电子面单支持全国发货直接购买后发货无需申请网点，每天14点之前下单当天18点左右出物流，22:00点之前下单早上7点左右出物流，超22:00点以后购买的是第二天14点发货！"},{"kdId":125,"kdName":"优速快递(拼多多-电子)","apiPrice":0.5,"pid":42,"tips":"本快递是拼多多电子面单支持全国发货直接购买后发货无需申请网点，每天14点之前下单当天18点左右出物流，22:00点之前下单早上7点左右出物流，超22:00点以后购买的是第二天14点发货！"},{"kdId":123,"kdName":"中通快运(拼多多-电子)","apiPrice":0.65,"pid":43,"tips":"-------(切记：选择中通快运发货！)-------本快递是拼多多电子面单支持全国发货直接购买后发货无需申请网点，每天14点之前下单当天18点左右出物流，22:00点之前下单早上10点左右出物流，超22:00点以后购买的是第二天14点发货！(切记：选择中通快运发货！)"},{"kdId":127,"kdName":"天天快递(拼多多-电子)","apiPrice":0.55,"pid":43,"tips":"本快递是拼多多电子面单支持全国发货直接购买后发货无需申请网点，每天14点之前下单当天18点左右出物流，22:00点之前下单早上7点左右出物流，超22:00点以后购买的是第二天14点发货！"},{"kdId":109,"kdName":"亚风速递(拼多多-电子)","apiPrice":0.6,"pid":44,"tips":"该快递目前只支持《拼多多》卖家订单发货，每天14点之前下单当天18点左右出物流，22:00点之前下单早上7点左右出物流，超22:00点以后购买的是第二天14点发货！"},{"kdId":113,"kdName":"申通快递(拼多多-电子)","apiPrice":0.8,"pid":45,"tips":"本快递是拼多多电子面单支持全国发货直接购买后发货无需申请网点，每天14点之前下单当天18点左右出物流，22:00点之前下单早上7点左右出物流，超22:00点以后购买的是第二天14点发货！"},{"kdId":101,"kdName":"中通快递(拼多多-电子)","apiPrice":0.65,"pid":45,"tips":"本快递是拼多多电子面单支持全国发货直接购买后发货无需申请网点，每天14点之前下单当天18点左右出物流，22:00点之前下单早上7点左右出物流，超22:00点以后购买的是第二天14点发货！"},{"kdId":117,"kdName":"百世快递(拼多多-电子)","apiPrice":0.65,"pid":45,"tips":"本快递是拼多多电子面单支持全国发货直接购买后发货无需申请网点，每天14点之前下单当天18点左右出物流，22:00点之前下单早上7点左右出物流，超22:00点以后购买的是第二天14点发货！"},{"kdId":30,"kdName":"韵达快递(拼多多-电子)","apiPrice":0.55,"pid":46,"tips":"本快递是拼多多电子面单支持全国发货直接购买后发货无需申请网点，每天14点之前下单当天18点左右出物流，22:00点之前下单早上10点左右出物流，超22:00点以后购买的是第二天14点发货！"},{"kdId":106,"kdName":"圆通快递(拼多多-电子)","apiPrice":0.8,"pid":47,"tips":"本快递是拼多多电子面单支持全国发货直接购买后发货无需申请网点，每天14点之前下单当天18点左右出物流，22:00点之前下单早上10点左右出物流，超22:00点以后购买的是第二天14点发货！"},{"kdId":112,"kdName":"承诺达特快(拼多多-电子)","apiPrice":0.4,"pid":48,"tips":"本快递是拼多多电子面单支持全国发货直接购买后发货无需申请网点，每天14点之前下单当天18点左右出物流，22:00点之前下单早上10点左右出物流，超22:00点以后购买的是第二天14点发货！"},{"kdId":114,"kdName":"宅急送快递(拼多多-电子)","apiPrice":0.8,"pid":49,"tips":"本快递是拼多多电子面单支持全国发货直接购买后发货无需申请网点，每天14点之前下单当天18点左右出物流，22:00点之前下单凌晨出物流，超22:00点以后购买的是第二天14点发货！"},{"kdId":41,"kdName":"圆通速递（全网-全国）","apiPrice":1.3,"pid":99,"tips":"本快递支持所有电商平台发货，购买后把快递单号拿去发货，快递上班时间购买1-2个小时内就出物流的了非上班时间购买24小时内出物流，本快递是直接对接快递公司一旦购买了以后是无法退款的，请您在确认购买之前核实清楚，避免给亲带麻烦！！（淘宝后台请选圆通速递发货）本快递购买较慢千万不能等不及就直接刷新页面否则会重复购买！"}]
     * status : ok
     */
    private List<KdPriceEntity> kdPrice;
    private String status;

    public void setKdPrice(List<KdPriceEntity> kdPrice) {
        this.kdPrice = kdPrice;
    }

    public void setStatus(String status) {
        this.status = status;
    }

    public List<KdPriceEntity> getKdPrice() {
        return kdPrice;
    }

    public String getStatus() {
        return status;
    }

    public class KdPriceEntity {
        /**
         * kdId : 107
         * kdName : 加运美速递（淘宝-专用）
         * apiPrice : 0.9
         * pid : 1
         * tips : 该快递目前只支持《淘宝》《天猫》《阿里》卖家订单发货，每天22:00点之前下单24点左右出物流，超22:00点以后购买的是第二天24点左右出物流！（请切换旧版发货）
         */
        private int kdId;
        private String kdName;
        private double apiPrice;
        private int pid;
        private String tips;

        public void setKdId(int kdId) {
            this.kdId = kdId;
        }

        public void setKdName(String kdName) {
            this.kdName = kdName;
        }

        public void setApiPrice(double apiPrice) {
            this.apiPrice = apiPrice;
        }

        public void setPid(int pid) {
            this.pid = pid;
        }

        public void setTips(String tips) {
            this.tips = tips;
        }

        public int getKdId() {
            return kdId;
        }

        public String getKdName() {
            return kdName;
        }

        public double getApiPrice() {
            return apiPrice;
        }

        public int getPid() {
            return pid;
        }

        public String getTips() {
            return tips;
        }
    }
}
